app/controllers/registrations_controller.rb

  def create

    build_resource(sign_up_params)

    access_level = resource.check_if_company_exists(params[:domain])

    # company_users = resource.company_users.build
    # puts "--------------------------------"
    # puts company_users.inspect
    # puts "--------------------------------"
    # company_users.company = resource.companies.first
    # company_users.access_level = access_level
    # company_users.first_name = resource.first_name
    # company_users.last_name = resource.last_name
    resource.save

    # puts "--------------------"
    # puts resource.companies.first.inspect
    # puts "--------------------"

    company_users = resource.company_users.first
    company_users.update_attributes(access_level: access_level, first_name: resource.first_name, last_name: resource.last_name)
---
UPDATE `companies` SET `domain` = NULL WHERE `companies`.`id` = 1
SELECT  `companies`.* FROM `companies` WHERE `companies`.`domain` = 'fghj' LIMIT 1
UPDATE `company_users` SET `access_level` = 1, `first_name` = '21', `last_name` = '21' WHERE `company_users`.`id` = 23
UPDATE `users` SET `last_sign_in_at` = '2015-06-02 02:30:42.137718', `current_sign_in_at` = '2015-06-02 02:30:42.137718', `last_sign_in_ip` = '::1', `current_sign_in_ip` = '::1', `sign_in_count` = 1, `updated_at` = '2015-06-02 02:30:42.145712' WHERE `users`.`id` = 3