app/controllers/registrations_controller.rb

SELECT  `companies`.* FROM `companies` INNER JOIN `company_users` ON `companies`.`id` = `company_users`.`company_id` WHERE `company_users`.`user_id` = 6  ORDER BY `companies`.`id` ASC LIMIT 1
SELECT  `company_users`.* FROM `company_users` WHERE `company_users`.`access_level` = 1 AND `company_users`.`first_name` = 'Leah' AND `company_users`.`last_name` = 'admin' LIMIT 1
SELECT COUNT(*) FROM `company_users` WHERE `company_users`.`company_id` = 1
INSERT INTO `companies` (`domain`, `name`) VALUES ('admin.com', 'admin')
INSERT INTO `company_users` (`company_id`, `access_level`, `first_name`, `last_name`, `user_id`) VALUES (1, 1, 'admin', 'admin', 2)
INSERT INTO `users` (`email`, `encrypted_password`, `first_name`, `last_name`, `date_of_birth`, `access_level`, `created_at`, `updated_at`) VALUES ('lj@admin.com', '$2a$10$ryUw.HAnmnfmYmf1cJDj/ukAIkh3DIkkmoAfs4tIlKjB021mapyUu', 'admin', 'admin', '2015-06-10', 2, '2015-06-02 05:41:50.489459', '2015-06-02 05:41:50.489459')
---
  def create

    build_resource(sign_up_params)

    if(resource.save)

      company = resource.check_if_company_exists(sign_up_params)
      access_level = resource.check_what_access_level(company.company_users)

      company_user = resource.company_users.build(company_id: company.id, access_level: access_level, first_name: resource.first_name, last_name: resource.last_name)

      company_user.save