app/controllers/users_controller.rb

  def index
    if current_user.present?
      @users = User.where(:id => current_user.id)
    else
      @users = User.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users`